Revit 2027 API
HasNoValueFilterRule Constructor
 constructs an instance of HasNoValueFilterRule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HasNoValueFilterRule(
	ElementId parameter
)
Public Sub New (
	parameter As ElementId
)
public:
HasNoValueFilterRule(
	ElementId^ parameter
)
new :
        parameter : ElementId -> HasNoValueFilterRule
Parameters
parameter ElementId
 The parameter that an element must not have a value for to pass this rule.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
HasNoValueFilterRule Class
Autodesk.Revit.DB Namespace